src/test/resources/jsonResponses/creditOperations/financing/financingV2/financingPayments/financingPaymentsResponseWithError.json

{
    "data": {
        "paidInstalments": 73,
        "contractOutstandingBalance": "1000.0400",
        "releases": [
            {
                "paymentId": "XlthLXpBLVowLTldW2EtekEtWjAtOVwtXXswLDk5fSQ",
                "instalmentId": "WGx0aExYcEJMVm93TFRsZFcyRXRla0V0V2pBdE9Wd3RYWH",
                "paidDate": "2021-05-21",
                "currency": "BRL",
                "paidAmount": "1000.0400",
                "overParcel": {
                    "fees": [
                        {
                            "feeName": "Reavaliação periódica do bem",
                            "feeCode": "aval_bem",
                            "feeAmount": "1000.0400"
                        }
                    ],
                    "charges": [
                        {
                            "chargeType": "JUROS_REMUNERATORIOS_POR_ATRASO",
                            "chargeAmount": "1000.0400",
                            "chargeAdditionalInfo": "Informações adicionais"
                        }
                    ]
                }
            }
        ]
    },
    "links": {
        "self": "https://api.banco.com.br/open-banking/api/v1/resource",
        "first": "https://api.banco.com.br/open-banking/api/v1/resource",
        "prev": "https://api.banco.com.br/open-banking/api/v1/resource",
        "next": "https://api.banco.com.br/open-banking/api/v1/resource",
        "last": "https://api.banco.com.br/open-banking/api/v1/resource"
    },
    "meta": {
        "totalRecords": 1,
        "totalPages": 1,
        "requestDateTime": "2021-05-21T08:30:00Z"
    }
}
